/**********************************************************************************************************
**
**                                    中国软件开源组织
**
**                                   嵌入式实时操作系统
**
**                                       SylixOS(TM)
**
**                               Copyright  All Rights Reserved
**
**--------------文件信息--------------------------------------------------------------------------------
**
** 文   件   名: mipsMmuCommon.h
**
** 创   建   人: Ryan.Xin (信金龙)
**
** 文件创建日期: 2015 年 09 月 01 日
**
** 描        述: MIPS 体系架构 MMU 通用函数支持.
*********************************************************************************************************/

#ifndef __MIPSMMUCOMMON_H
#define __MIPSMMUCOMMON_H

/*********************************************************************************************************
  裁剪支持
*********************************************************************************************************/
#if LW_CFG_VMM_EN > 0

/*********************************************************************************************************
  基本操作
*********************************************************************************************************/

UINT32  mipsMmuAbtFaultStatus(VOID);
UINT32  mipsMmuPreFaultStatus(VOID);
UINT32  mipsMmuAbtFaultAddr(VOID);
VOID    mipsMmuEnable(VOID);
VOID    mipsMmuDisable(VOID);
VOID    mipsMmuSetTTBase(LW_PGD_TRANSENTRY  *pgdEntry);
VOID    mipsMmuInvalidateTLB(VOID);
VOID    mipsMmuInvalidateTLBMVA(PVOID pvVAddr);

#endif                                                                  /*  LW_CFG_VMM_EN > 0           */
/*********************************************************************************************************
  异常信息获取
*********************************************************************************************************/

addr_t  mipsGetAbtAddr(VOID);
ULONG   mipsGetAbtType(VOID);
addr_t  mipsGetPreAddr(addr_t  ulRetLr);
ULONG   mipsGetPreType(VOID);

#endif                                                                  /*  __MIPSMMUCOMMON_H            */
/*********************************************************************************************************
  END
*********************************************************************************************************/
