/*********************************************************************************************************
**
**                                    中国软件开源组织
**
**                                   嵌入式实时操作系统
**
**                                SylixOS(TM)  LW : long wing
**
**                               Copyright All Rights Reserved
**
**--------------文件信息--------------------------------------------------------------------------------
**
** 文   件   名: mipsUnwind.c
**
** 创   建   人: Ryan.Xin (信金龙)
**
** 文件创建日期: 2015 年 09 月 01 日
**
** 描        述: 此段代码算法出自 android 源码.
*********************************************************************************************************/
#define  __SYLIXOS_KERNEL
#include "SylixOS.h"
#ifdef   LW_CFG_CPU_ARCH_MIPS                                            /*  MIPS 体系结构              */
/*********************************************************************************************************
  裁剪支持
*********************************************************************************************************/
#if LW_CFG_MODULELOADER_EN > 0
#include "../SylixOS/loader/include/loader_lib.h"
/*********************************************************************************************************
** 函数名称: dl_unwind_find_exidx
** 功能描述: 根据pc指针，获取pc所在的模块并返回该模块中的.ARM.exidx段地址
** 输　入  : pc         程序寄存器指针
**           pcount     .ARM.exidx段中的表项数目
**           pvVProc    进程控制卡
** 输　出  : 成功返回.ARM.exidx段地址，失败返回NULL
** 全局变量:
** 调用模块:
*********************************************************************************************************/
_Unwind_Ptr dl_unwind_find_exidx (_Unwind_Ptr pc, int *pcount, PVOID *pvVProc)
{
    return  (LW_NULL);
}

#endif                                                                  /*  LW_CFG_MODULELOADER_EN > 0  */
#endif                                                                  /*  LW_CFG_CPU_ARCH_MIPS        */
/*********************************************************************************************************
  END
*********************************************************************************************************/
